app/controllers/admin/settings_controller.rb

  def index
  	if Preference.all.empty?
  		@preference = Preference.create
---
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1
INSERT INTO "preferences" ("song_sort_order", "artist_sort_order", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["song_sort_order", "DESC"], ["artist_sort_order", "DESC"], ["created_at", "2016-02-01 23:06:05.250325"], ["updated_at", "2016-02-01 23:06:05.250325"]]

  def update
  	@preference = Preference.find_by(params[:id])
  	@preference.update(settings_params)
---
UPDATE "preferences" SET "artist_sort_order" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["artist_sort_order", "ASC"], ["updated_at", "2016-02-01 23:13:41.334665"], ["id", 1]]